cask_args appdir: '/Applications'

tap 'caskroom/fonts'

# Install essentials
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-history-substring-search'
# Install GNU utilities
# To use them with their normal names, add **each** binary to $PATH (check .path)
# To access their man pages,  add **each** manual to $MANPATH (check .exports)
brew 'coreutils'
brew 'gnu-sed'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install some other useful utilities like `sponge`.
brew 'moreutils'
brew 'ag'
brew 'grep', args: ['with-default-names']
brew 'fasd'
brew 'tree'
brew 'rmtrash'
brew 'rlwrap'
# Install Pipe Viewer
brew 'pv'

# Install dev tools
brew 'git'
brew 'icdiff'
brew 'diff-so-fancy'
brew 'wget'
brew 'jq'
brew 'go'
brew 'vim'
tap 'neovim/neovim'
brew 'neovim'
tap 'd12frosted/emacs-plus'
brew 'emacs-plus'
cask 'java'
brew 'leiningen'
brew 'chruby'
brew 'ruby-install'
brew 'node'
brew 'scala'
brew 'sbt'

# Install browsers
cask 'google-chrome'
cask 'firefox'

# Install communication applications
cask 'slack'
cask 'skype'
cask 'telegram'
cask 'zoomus'

# Install productivity applications
cask 'alfred'
cask 'rescuetime'

# Install security & privacy applications
cask '1password'
cask 'nordvpn' # VPN client

# Install media & storage applications
cask 'spotify'
cask 'kindle'
cask 'dropbox'

# Install dev applications
cask 'iterm2'
cask 'dash'
cask 'postman'
cask 'docker'

# Install font
cask 'font-source-code-pro'
