cask_args appdir: '/Applications'

# Install essentials
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-history-substring-search'
brew 'romkatv/powerlevel10k/powerlevel10k'

# Install GNU utilities
# To use them with their normal names, add **each** binary to $PATH (check .path)
# To access their man pages,  add **each** manual to $MANPATH (check .exports)
brew 'coreutils'
brew 'gnu-sed'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install some other useful utilities like `sponge`.
brew 'moreutils'
brew 'ag'
brew 'fzf'
brew 'grep'
brew 'fasd'
brew 'tree'
brew 'trash'
brew 'rlwrap'
# Install Pipe Viewer
brew 'pv'

# Install dev tools
brew 'git'
brew 'icdiff'
brew 'diff-so-fancy'
brew 'wget'
brew 'jq'
brew 'go'
brew 'tmux'
brew 'vim'
tap 'neovim/neovim'
brew 'neovim'
tap 'd12frosted/emacs-plus@28'
brew 'emacs-plus'
brew 'intellij-idea-ce'
brew 'java'
brew 'java11'
brew 'leiningen'
brew 'chruby'
brew 'ruby-install'
brew 'node'
brew 'scala'
brew 'sbt'
brew 'graphviz'
brew 'plantuml'
brew 'scalastyle'
brew 'circleci'
brew 'pyenv'
brew 'tldr'
brew 'clojure-lsp'
brew 'jenv'

# Install keyboard tinkering tools
tap 'qmk/qmk'
brew 'qmk/qmk/qmk'

# Install browsers
cask 'google-chrome'
cask 'firefox'

# Install communication applications
cask 'slack'
cask 'skype'
cask 'telegram'
cask 'whatsapp'
cask 'zoom'
cask 'signal'

# Install productivity applications
cask 'alfred'
cask 'rescuetime'

# Install security & privacy applications
cask '1password'
cask 'nordvpn' # VPN client

# Install media & storage applications
cask 'spotify'
cask 'kindle'
cask 'dropbox'

# Install dev applications
cask 'iterm2'
cask 'dash'
cask 'insomnia'
cask 'docker'

# Install font

brew 'svn'
tap 'homebrew/cask-fonts'
cask 'font-source-code-pro'
